#Это я для себя, для удобства <3
def ent():
  print('-----------------------------')

#1st program
print("(9^0,5) * 5 =", (9**0.5) * 5 )
ent()

#2nd program
print(9.99 > 9.98 and 1000 != 1000.1)
ent()

#3rd program
a, b = 2*2+2, 2*(2+2)
print(f'2 * 2 + 2 = {a}')
print(f'2 * (2 + 2) = {b}')
print(f'{a} equal {b}? Answer is', a == b)
ent()

#4th program *
a = "123.456"                         #Условие задачи 4
b = "123.456"                         #Для эксперимента
print("(123.456 * 10) % 1230.56 =",   #Решение 1
      int((float(a) * 10) % 1230.56)) 

print(int(b[4])) #Решение 2

#Или решил проверить так: получилось :)
#int() вставил, если нужен был именно тип int,
#без него вывелась бы строка